# Course Project : Terpbuy ( Part 2 - Connecting Python To SQL)

In [2]:
##Q.1) Write a query to show the quantity of items sold by each department. Sort the results by department name.
import pandas as pd
import numpy as np
import mysql.connector

In [4]:
!pip install mysql-connector-python

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: mysql-connector-python in c:\programdata\anaconda3\lib\site-packages (8.3.0)

In [6]:
conn= mysql.connector.connect(host='127.0.0.1', database='TerpBuy',user='root',password='Mugiwara@09')

In [8]:
df_dept=pd.read_sql('select p.department_id,ol.quantity_sold,d.department_name from product p inner join order_line ol on ol.product_id=p.product_id \
                    inner join department d on p.department_id=d.department_id',conn,index_col='department_id')
df_dept

C:\Users\Rahul Mahadik\AppData\Local\Temp\ipykernel_11996\2208127234.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_dept=pd.read_sql('select p.department_id,ol.quantity_sold,d.department_name from product p inner join order_line ol on ol.product_id=p.product_id \

               quantity_sold department_name
department_id
7                          1        Fan Shop
5                          2            Golf
3                          4        Footwear
4                          4         Apparel
4                          2         Apparel
...                      ...             ...
4                          1         Apparel
4                          1         Apparel
4                          1         Apparel
4                          1         Apparel
4                          1         Apparel

[4783 rows x 2 columns]

In [11]:
##Q.2) Using the query you wrote in Question 1, create a data visualization (e.g., a bar chart) showing all departments and the number of items each of them sold. 
## Using a markdown cell, explain what you observe from the analysis.
##--

In [14]:
##Q.3) Write a query to show the number of orders placed in each year in which at least one order was placed.
##Hint: Search online to learn about MySQL’s YEAR() function to query data.
df_orders=pd.read_sql('SELECT YEAR(order_date) AS order_year, COUNT(*) AS num_orders FROM orders GROUP BY order_year',conn,index_col='order_year')
df_orders

C:\Users\Rahul Mahadik\AppData\Local\Temp\ipykernel_11996\2581298601.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df_orders=pd.read_sql('SELECT YEAR(order_date) AS order_year, COUNT(*) AS num_orders FROM orders GROUP BY order_year',conn,index_col='order_year')

            num_orders
order_year
2018               585
2019               708
2020               497
2021               362

In [17]:
##Q.4) Using the query you wrote in Question 3, create a data visualization (e.g., a line graph) showing all years and the number of orders placed during each year, 
## to see if there is a trend in ordering. Using a markdown cell, explain what you observe from the analysis.

##----